/*
* 要求 *
设将n(n>1)个整数存放到一维数组R中,
设计一个算法,将R中保存的序列循环左移p(O<p<n)个位置,
即将R中的数据由(r0, r1,...,r(n-1))变换为(rp,r(p+1),...,r(n-1),r0,r1,...,r(p-1))。
*/

/*
* 算法思想 *
要将n个整数存放到一维数组而且能左移p个位置，就要先定义一个长度至少为2n的数组
因为是将元素左移，所以将元素内容储存在数组下标较大的一端
然后从第一个元素开始遍历数组R，将下标为i的元素和下标为i-p的元素交换
最后输出数组，验证算法是否成功
*/

/////////////////////////////////////////////////////////////////////////////
#include <stdio.h>
#include <stdlib.h>
#define N 14		//n为7，所以数组最大长度N应该至少为14

int main()
{
	int n = 7;
	int R[N] = { 0 };		//定义一维数组R
	
	for (int i = N - n; i < N; i++)		//将n个整数存放到R中
		R[i] = i;

	printf("数组下标：");		//输出下标
	for (int i = 0; i < N; i++)
		printf("%d\t", i);

	printf("\n\n移动之前：");		//输出移动元素前下标对应的元素
	for (int i = 0; i < N; i++)
		printf("%d\t", R[i]);

	int temp = 0;
	int p = 5;
	for (int i = N - n; i < N; i++)		//从第一个元素开始交换
	{
		if (p > n || p < 0)		//保证0<p<n，超出范围跳出循环
		{
			printf("不能这么移动！");
			break;
		}

		temp = R[i - p];
		R[i - p] = R[i];
		R[i] = temp;
	}
	
	printf("\n\n移动之后：");		//输出移动元素后下标对应的元素
	for (int i = 0; i < N; i++)
		printf("%d\t", R[i]);
}
